bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/adc_lld.h
/*
    SPC5 RLA - Copyright (C) 2015 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License").
    You may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
    Portion of the code in this module have been taken from the ChibiOS
    project (ChibiOS - Copyright (C) 2006..2015) licensed under Apache
    2.0 license.
*/

/**
 * @file    adc_lld.h
 * @brief   SPC5xx ADC low level driver header.
 *
 * @addtogroup ADC
 * @{
 */

#ifndef _ADC_LLD_H_
#define _ADC_LLD_H_

#include "spc5_lld.h"
#include "lldconf.h"

#if (LLD_USE_ADC == TRUE) || defined(__DOXYGEN__)

#if SPC5_ADC_DMA_MODE != SPC5_ADC_DMA_OFF
#include "spc5_edma.h"
#endif
#include "spc5_adc.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Analog channel identifiers
 * @{
 */
#define ADC_CHN_AN0                 0U
#define ADC_CHN_AN1                 1U
#define ADC_CHN_AN2                 2U
#define ADC_CHN_AN3                 3U
#define ADC_CHN_AN4                 4U
#define ADC_CHN_AN5                 5U
#define ADC_CHN_AN6                 6U
#define ADC_CHN_AN7                 7U
#define ADC_CHN_AN8                 8U
#define ADC_CHN_AN9                 9U
#define ADC_CHN_AN10                10U
#define ADC_CHN_AN11                11U
#define ADC_CHN_AN12                12U
#define ADC_CHN_AN13                13U
#define ADC_CHN_AN14                14U
#define ADC_CHN_AN15                15U
#define ADC_CHN_AN16                16U
#define ADC_CHN_AN17                17U
#define ADC_CHN_AN18                18U
#define ADC_CHN_AN19                19U
#define ADC_CHN_AN20                20U
#define ADC_CHN_AN21                21U
#define ADC_CHN_AN22                22U
#define ADC_CHN_AN23                23U
#define ADC_CHN_AN24                24U
#define ADC_CHN_AN25                25U
#define ADC_CHN_AN26                26U
#define ADC_CHN_AN27                27U
#define ADC_CHN_AN28                28U
#define ADC_CHN_AN29                29U
#define ADC_CHN_AN30                30U
#define ADC_CHN_AN31                31U
#define ADC_CHN_AN32                32U
#define ADC_CHN_AN33                33U
#define ADC_CHN_AN34                34U
#define ADC_CHN_AN35                35U
#define ADC_CHN_AN36                36U
#define ADC_CHN_AN37                37U
#define ADC_CHN_AN38                38U
#define ADC_CHN_AN39                39U
#define ADC_CHN_AN40                40U
#define ADC_CHN_AN41                41U
#define ADC_CHN_AN42                42U
#define ADC_CHN_AN43                43U
#define ADC_CHN_AN44                44U
#define ADC_CHN_AN45                45U
#define ADC_CHN_AN46                46U
#define ADC_CHN_AN47                47U
#define ADC_CHN_AN48                48U
#define ADC_CHN_AN49                49U
#define ADC_CHN_AN50                50U
#define ADC_CHN_AN51                51U
#define ADC_CHN_AN52                52U
#define ADC_CHN_AN53                53U
#define ADC_CHN_AN54                54U
#define ADC_CHN_AN55                55U
#define ADC_CHN_AN56                56U
#define ADC_CHN_AN57                57U
#define ADC_CHN_AN58                58U
#define ADC_CHN_AN59                59U
#define ADC_CHN_AN60                60U
#define ADC_CHN_AN61                61U
#define ADC_CHN_AN62                62U
#define ADC_CHN_AN63                63U
#define ADC_CHN_AN64                64U
#define ADC_CHN_AN65                65U
#define ADC_CHN_AN66                66U
#define ADC_CHN_AN67                67U
#define ADC_CHN_AN68                68U
#define ADC_CHN_AN69                69U
#define ADC_CHN_AN70                70U
#define ADC_CHN_AN71                71U
#define ADC_CHN_AN72                72U
#define ADC_CHN_AN73                73U
#define ADC_CHN_AN74                74U
#define ADC_CHN_AN75                75U
#define ADC_CHN_AN76                76U
#define ADC_CHN_AN77                77U
#define ADC_CHN_AN78                78U
#define ADC_CHN_AN79                79U
#define ADC_CHN_AN80                80U
#define ADC_CHN_AN81                81U
#define ADC_CHN_AN82                82U
#define ADC_CHN_AN83                83U
#define ADC_CHN_AN84                84U
#define ADC_CHN_AN85                85U
#define ADC_CHN_AN86                86U
#define ADC_CHN_AN87                87U
#define ADC_CHN_AN88                88U
#define ADC_CHN_AN89                89U
#define ADC_CHN_AN90                90U
#define ADC_CHN_AN91                91U
#define ADC_CHN_AN92                92U
#define ADC_CHN_AN93                93U
#define ADC_CHN_AN94                94U
#define ADC_CHN_AN95                95U
/** @} */

/**
 * @name    Watchdog threshold identifiers
 * @{
 */
#define ADC_WDT0                    0U
#define ADC_WDT1                    1U
#define ADC_WDT2                    2U
#define ADC_WDT3                    3U
#define ADC_WDT4                    4U
#define ADC_WDT5                    5U
#define ADC_WDT6                    6U
#define ADC_WDT7                    7U
#define ADC_WDT8                    8U
#define ADC_WDT9                    9U
#define ADC_WDT10                   10U
#define ADC_WDT11                   11U
#define ADC_WDT12                   12U
#define ADC_WDT13                   13U
#define ADC_WDT14                   14U
#define ADC_WDT15                   15U
/** @} */

/**
 * @name    ADC MCR register definitions
 * @{
 */
#define ADC_MCR_OWREN               (1UL << 31)
#define ADC_MCR_WLSIDE              (1UL << 30)
#define ADC_MCR_MODE                (1UL << 29)
#define ADC_MCR_NSTART              (1UL << 24)
#define ADC_MCR_JTRGEN              (1UL << 22)
#define ADC_MCR_JEDGE               (1UL << 21)
#define ADC_MCR_JSTART              (1UL << 20)
#define ADC_MCR_CTUEN               (1UL << 17)
#define ADC_MCR_ADCLKSEL            (1UL << 8)
#define ADC_MCR_ABORTCHAIN          (1UL << 7)
#define ADC_MCR_ABORT               (1UL << 6)
#define ADC_MCR_ACKO                (1UL << 5)
#define ADC_MCR_PWDN                (1UL << 0)
/** @} */

/**
 * @name    ADC MSR register definitions
 * @{
 */
#define ADC_MSR_NSTART              (1UL << 24)
#define ADC_MSR_JABORT              (1UL << 23)
#define ADC_MSR_JSTART              (1UL << 20)
#define ADC_MSR_CTUSTART            (1UL << 16)
#define ADC_MSR_CHADDR              (1U << 9)
#define ADC_MSR_ACKO                (1U << 5)
#define ADC_MSR_ADCSTATUS           (1U << 0)
/** @} */

/**
 * @name    ADC ISR register definitions
 * @{
 */
#define ADC_ISR_EOCTU               (1U << 4)
#define ADC_ISR_JEOC                (1U << 3)
#define ADC_ISR_JECH                (1U << 2)
#define ADC_ISR_EOC                 (1U << 1)
#define ADC_ISR_ECH                 (1U << 0)
/** @} */

/**
 * @name    ADC IMR register definitions
 * @{
 */
#define ADC_IMR_MSKEOCTU            (1U << 4)
#define ADC_IMR_MSKJEOC             (1U << 3)
#define ADC_IMR_MSKJECH             (1U << 2)
#define ADC_IMR_MSKEOC              (1U << 1)
#define ADC_IMR_MSKECH              (1U << 0)
/** @} */

/**
 * @name    ADC DMAE register definitions
 * @{
 */
#define ADC_DMAE_DCLR               (1U << 1)
#define ADC_DMAE_DMAEN              (1UL << 0)
/** @} */

/**
 * @name    ADC CDR register definitions
 * @{
 */
#define ADC_CDR_VALID               (1UL<< 19)
#define ADC_CDR_OVERW               (1UL<< 18)
#define ADC_CDR_RESULT              (1UL<< 16)
#define ADC_CDR_CDATA_LEFT          (1U << 6)
#define ADC_CDR_CDATA_RIGHT         (1U << 0)
/** @} */

/**
 * @name    ADC TRC registers definitions
 * @{
 */
#define ADC_TRC_THREN               (1U << 15)
#define ADC_TRC_THRINV              (1U << 14)
#define ADC_TRC_THROP               (1U << 13)
#define ADC_TRC_THRCH(n)            ((n) << 0)
/** @} */

/**
 * @name    ADC THRHLR registers definitions
 * @{
 */
#define ADC_THRHLR_THRH(n)          ((uint32_t)(n) << 16U)
#define ADC_THRHLR_THRL(n)          ((uint32_t)(n) << 0U)
/** @} */

/**
 * @name    ADC CWSEL registers definitions
 * @{
 */
#define ADC_CWSEL0_WSEL_CHN(n)      (((n) - 0U) * 4U)
#define ADC_CWSEL1_WSEL_CHN(n)      (((n) - 8U) * 4U)
#define ADC_CWSEL2_WSEL_CHN(n)      (((n) - 16U) * 4U)
#define ADC_CWSEL3_WSEL_CHN(n)      (((n) - 24U) * 4U)
#define ADC_CWSEL4_WSEL_CHN(n)      (((n) - 32U) * 4U)
#define ADC_CWSEL5_WSEL_CHN(n)      (((n) - 40U) * 4U)
#define ADC_CWSEL6_WSEL_CHN(n)      (((n) - 48U) * 4U)
#define ADC_CWSEL7_WSEL_CHN(n)      (((n) - 56U) * 4U)
#define ADC_CWSEL8_WSEL_CHN(n)      (((n) - 64U) * 4U)
#define ADC_CWSEL9_WSEL_CHN(n)      (((n) - 72U) * 4U)
#define ADC_CWSEL10_WSEL_CHN(n)     (((n) - 80U) * 4U)
#define ADC_CWSEL11_WSEL_CHN(n)     (((n) - 88U) * 4U)
/** @} */

/**
 * @name    ADC CWENR registers definitions
 * @{
 */
#define ADC_CWENR0_CWEN_CHN(n)      (1UL<< (n))
#define ADC_CWENR1_CWEN_CHN(n)      (1UL<< ((n) - 32U))
#define ADC_CWENR2_CWEN_CHN(n)      (1UL<< ((n) - 64U))
/** @} */

/**
 * @name    ADC CTR registers definitions
 * @{
 */
#define ADC_CTR_INPLATCH            (1U << 15)
#define ADC_CTR_OFFSHIFT(n)         ((n) << 12)
#define ADC_CTR_INPCMP(n)           ((n) << 9)
#define ADC_CTR_INPSAMP(n)          ((n) << 0)
/** @} */

/**
 * @name    ADC WTIMR registers definitions
 * @{
 */
#if SPC5_ADC_HAS_TRC
#define ADC_WTIMR_MSKWDG0_LOW       (1U << 0)
#define ADC_WTIMR_MSKWDG0_HIGH      (1U << 4)
#define ADC_WTIMR_MSKWDG0_BOTH      (17U << 0)
#define ADC_WTIMR_MSKWDG1_LOW       (1U << 1)
#define ADC_WTIMR_MSKWDG1_HIGH      (1U << 5)
#define ADC_WTIMR_MSKWDG1_BOTH      (17U << 1)
#define ADC_WTIMR_MSKWDG2_LOW       (1U << 2)
#define ADC_WTIMR_MSKWDG2_HIGH      (1U << 6)
#define ADC_WTIMR_MSKWDG2_BOTH      (17U << 2)
#define ADC_WTIMR_MSKWDG3_LOW       (1U << 3)
#define ADC_WTIMR_MSKWDG3_HIGH      (1U << 7)
#define ADC_WTIMR_MSKWDG3_BOTH      (17U << 3)
#else
#define ADC_WTIMR_MSKWDG0_LOW       (1U << 0)
#define ADC_WTIMR_MSKWDG0_HIGH      (1U << 1)
#define ADC_WTIMR_MSKWDG0_BOTH      (3U << 0)
#define ADC_WTIMR_MSKWDG1_LOW       (1U << 2)
#define ADC_WTIMR_MSKWDG1_HIGH      (1U << 3)
#define ADC_WTIMR_MSKWDG1_BOTH      (3U << 2)
#define ADC_WTIMR_MSKWDG2_LOW       (1U << 4)
#define ADC_WTIMR_MSKWDG2_HIGH      (1U << 5)
#define ADC_WTIMR_MSKWDG2_BOTH      (3U << 4)
#define ADC_WTIMR_MSKWDG3_LOW       (1U << 6)
#define ADC_WTIMR_MSKWDG3_HIGH      (1U << 7)
#define ADC_WTIMR_MSKWDG3_BOTH      (3U << 6)
#define ADC_WTIMR_MSKWDG4_LOW       (1U << 8)
#define ADC_WTIMR_MSKWDG4_HIGH      (1U << 9)
#define ADC_WTIMR_MSKWDG4_BOTH      (3U << 8)
#define ADC_WTIMR_MSKWDG5_LOW       (1U << 10)
#define ADC_WTIMR_MSKWDG5_HIGH      (1U << 11)
#define ADC_WTIMR_MSKWDG5_BOTH      (3U << 10)
#define ADC_WTIMR_MSKWDG6_LOW       (1U << 12)
#define ADC_WTIMR_MSKWDG6_HIGH      (1U << 13)
#define ADC_WTIMR_MSKWDG6_BOTH      (3U << 12)
#define ADC_WTIMR_MSKWDG7_LOW       (1U << 14)
#define ADC_WTIMR_MSKWDG7_HIGH      (1U << 15)
#define ADC_WTIMR_MSKWDG7_BOTH      (3U << 14)
#define ADC_WTIMR_MSKWDG8_LOW       (1UL << 16)
#define ADC_WTIMR_MSKWDG8_HIGH      (1UL << 17)
#define ADC_WTIMR_MSKWDG8_BOTH      (3UL<< 16)
#define ADC_WTIMR_MSKWDG9_LOW       (1UL<< 18)
#define ADC_WTIMR_MSKWDG9_HIGH      (1UL<< 19)
#define ADC_WTIMR_MSKWDG9_BOTH      (3UL<< 18)
#define ADC_WTIMR_MSKWDG10_LOW      (1UL<< 20)
#define ADC_WTIMR_MSKWDG10_HIGH     (1UL<< 21)
#define ADC_WTIMR_MSKWDG10_BOTH     (3UL<< 20)
#define ADC_WTIMR_MSKWDG11_LOW      (1UL<< 22)
#define ADC_WTIMR_MSKWDG11_HIGH     (1UL<< 23)
#define ADC_WTIMR_MSKWDG11_BOTH     (3UL<< 22)
#define ADC_WTIMR_MSKWDG12_LOW      (1UL<< 24)
#define ADC_WTIMR_MSKWDG12_HIGH     (1UL<< 25)
#define ADC_WTIMR_MSKWDG12_BOTH     (3UL<< 24)
#define ADC_WTIMR_MSKWDG13_LOW      (1UL<< 26)
#define ADC_WTIMR_MSKWDG13_HIGH     (1UL<< 27)
#define ADC_WTIMR_MSKWDG13_BOTH     (3UL<< 26)
#define ADC_WTIMR_MSKWDG14_LOW      (1UL<< 28)
#define ADC_WTIMR_MSKWDG14_HIGH     (1UL<< 29)
#define ADC_WTIMR_MSKWDG14_BOTH     (3UL<< 28)
#define ADC_WTIMR_MSKWDG15_LOW      (1UL<< 30)
#define ADC_WTIMR_MSKWDG15_HIGH     (1UL<< 31)
#define ADC_WTIMR_MSKWDG15_BOTH     (3UL<< 30)
#endif
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   ADCD1 driver enable switch.
 * @details If set to @p TRUE the support for ADC0 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_ADC_USE_ADC0) || defined(__DOXYGEN__)
#define SPC5_ADC_USE_ADC0                   FALSE
#endif

/**
 * @brief   ADC0 WD interrupt priority level setting.
 */
#if !defined(SPC5_ADC_ADC0_WD_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC0_WD_PRIORITY           12
#endif

/**
 * @brief   ADC0 DMA IRQ priority.
 */
#if !defined(SPC5_ADC_ADC0_DMA_IRQ_PRIO) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC0_DMA_IRQ_PRIO          12
#endif

/**
 * @brief   ADC0 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_ADC_ADC0_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC0_START_PCTL            (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   ADC0 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_ADC_ADC0_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC0_STOP_PCTL             (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   ADCD2 driver enable switch.
 * @details If set to @p TRUE the support for ADC1 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_ADC_USE_ADC1) || defined(__DOXYGEN__)
#define SPC5_ADC_USE_ADC1                   FALSE
#endif

/**
 * @brief   ADC1 WD interrupt priority level setting.
 */
#if !defined(SPC5_ADC_ADC1_WD_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC1_WD_PRIORITY           12
#endif

/**
 * @brief   ADC1 DMA IRQ priority.
 */
#if !defined(SPC5_ADC_ADC1_DMA_IRQ_PRIO) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC1_DMA_IRQ_PRIO          12
#endif

/**
 * @brief   ADC1 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_ADC_ADC1_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC1_START_PCTL            (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   ADC1 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode. The defaults of the run modes
 *          are defined in @p hal_lld.h.
 */
#if !defined(SPC5_ADC_ADC1_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_ADC_ADC1_STOP_PCTL             (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   Selects the DMA mode for the ADC driver.
 * @details The driver is able to work 1 only mode:
 *          - @p SPC5_ADC_DMA_OFF, the DMA is not used at all, the drivers
 *            works in a fully interrupt-driven way.
 *          - @p SPC5_ADC_DMA_ON, 1 DMA channel is used.
 *          .
 * @note    DMA modes are only possible on those platforms where a DMA
 *          controllers is present.
 */
#if !defined(SPC5_ADC_DMA_MODE) || defined(__DOXYGEN__)
#define SPC5_ADC_DMA_MODE                   SPC5_ADC_DMA_OFF
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

#if !(SPC5_ADC_DMA_MODE == SPC5_ADC_DMA_OFF) &&                            \
    !(SPC5_ADC_DMA_MODE == SPC5_ADC_DMA_ON)
#error "invalid SPC5_ADC_DMA_MODE selected"
#endif

#if (SPC5_HAS_EDMA == FALSE) && (SPC5_ADC_DMA_MODE != SPC5_ADC_DMA_OFF)
#error "ADC with DMA is not supported on this device, no DMA found"
#endif

