bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/adc_lld.h
#if (SPC5_HAS_ADC0 == FALSE) && (SPC5_ADC_USE_ADC0 == TRUE)
#error "ADC0 not present in the selected device"
#endif

#if (SPC5_HAS_ADC1 == FALSE)  && (SPC5_ADC_USE_ADC1 == TRUE)
#error "ADC1 not present in the selected device"
#endif

#if (SPC5_ADC_USE_ADC0 == FALSE) && (SPC5_ADC_USE_ADC1 == FALSE)
#error "ADC driver activated but no ADC peripheral assigned"
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   ADC clock frequency.
 */
typedef enum {
  HALF_PERIPHERAL_SET_CLOCK_FREQUENCY = 0,  /**< ADC clock frequency is
                                                 half Peripheral Set Clock
                                                 frequency.                   */
  PERIPHERAL_SET_CLOCK_FREQUENCY = 1        /**< ADC clock frequency is equal
                                                 to Peripheral Set Clock
                                                 frequency.                   */
} adc_clock;

/**
 * @brief   ADC sample data type.
 */
typedef uint16_t adcsample_t;

/**
 * @brief   Channels number in a conversion group.
 */
typedef uint16_t adc_channels_num_t;

/**
 * @brief   Possible ADC failure causes.
 * @note    Error codes are architecture dependent and should not relied
 *          upon.
 */
typedef enum {
  ADC_ERR_DMAFAILURE = 0,                   /**< DMA operations failure.*/
  ADC_ERR_AWD = 1                          /**< Watchdog triggered.    */
} adcerror_t;

/**
 * @brief   Type of a structure representing an ADC driver.
 */
typedef struct ADCDriver ADCDriver;

/**
 * @brief   ADC notification callback type.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object triggering the
 *                      callback
 * @param[in] buffer    pointer to the most recent samples data
 * @param[in] n         number of buffer rows available starting from @p buffer
 */
typedef void (*adccallback_t)(ADCDriver *adcp, adcsample_t *buffer, size_t n);

/**
 * @brief   ADC error callback type.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object triggering the
 *                      callback
 * @param[in] err       ADC error code
 */
typedef void (*adcerrorcallback_t)(ADCDriver *adcp, adcerror_t err);

/**
 * @brief   Conversion group configuration structure.
 * @details This implementation-dependent structure describes a conversion
 *          operation.
 * @note    Implementations may extend this structure to contain more,
 *          architecture dependent, fields.
 */
typedef struct {
  /**
   * @brief   Enables the circular buffer mode for the group.
   */
  uint8_t                   circular;
  /**
   * @brief   Number of the analog channels belonging to the conversion group.
   */
  adc_channels_num_t        num_channels;
  /**
   * @brief   Callback function associated to the group or @p NULL.
   */
  adccallback_t             end_cb;
  /**
   * @brief   Error callback or @p NULL.
   */
  adcerrorcallback_t        error_cb;
  /* End of the mandatory fields.*/
#if (SPC5_ADC_HAS_TRC == TRUE)
  /**
   * @brief   ADC TRC registers initialization data.
   */
  uint32_t                  trc[4];
  /**
   * @brief   ADC THRHLR registers initialization data.
   */
  uint32_t                  thrhlr[4];
  /**
   * @brief   ADC WTIMR register initialization data.
   */
  uint32_t                  wtimr;
#else
  /**
   * @brief   ADC CWSEL registers initialization data.
   */
  uint32_t                  cwsel[12];
  /**
   * @brief   ADC THRHLR registers initialization data.
   */
  uint32_t                  thrhlr[16];
  /**
   * @brief   ADC CWENR registers initialization data.
   */
  uint32_t                  cwenr[3];
  /**
   * @brief   ADC WTIMR register initialization data.
   */
  uint32_t                  wtimr;
#endif
  /**
   * @brief   ADC CTR registers initialization data.
   */
  uint32_t                  ctr[3];
  /**
   * @brief   ADC Initial conversion channel.
   * @note    Only the conversion of contiguous channels is implemented.
   *          Specify initial conversion channel.
   */
  uint32_t                  init_channel;
} ADCConversionGroup;

/**
 * @brief   Driver configuration structure.
 * @note    Empty in this implementation can be ignored.
 */
typedef struct {
  uint32_t                  dummy;
} ADCConfig;

/**
 * @brief   Structure representing an ADC driver.
 */
struct ADCDriver {
  /**
   * @brief   Current configuration data.
   */
  const ADCConfig           *config;
  /**
   * @brief   Current samples buffer pointer or @p NULL.
   */
  adcsample_t               *samples;
  /**
   * @brief   Current samples buffer depth or @p 0.
   */
  size_t                    depth;
  /**
   * @brief   Current conversion group pointer or @p NULL.
   */
  const ADCConversionGroup  *grpp;
#if defined(ADC_DRIVER_EXT_FIELDS)
  ADC_DRIVER_EXT_FIELDS
#endif
  /* End of the mandatory fields.*/

#if (SPC5_ADC_DMA_MODE == SPC5_ADC_DMA_ON) || defined(__DOXYGEN__)
  /**
   * @brief   EDMA channel used for the ADC.
   */
  edma_channel_t            adc_dma_channel;
#else /* SPC5_ADC_DMA_MODE == SPC5_ADC_DMA_OFF */
  /**
   * @brief   Memory pointer for RX operations.
   */
  adcsample_t               *rx_ptr;
  /**
   * @brief   Remaining frames to be received.
   */
  size_t                    rx_cnt;
#endif /* SPC5_ADC_DMA_MODE == SPC5_ADC_DMA_OFF */
  /**
   * @brief   ADC Analog Watchdog Threshold Interrupt Status Register.
   */
  uint32_t                  adc_awd_err;
  /**
   * @brief Pointer to the ADCx registers block.
   */
  volatile struct spc5_adc  *adc_tagp;
};

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/
/**
 * @brief   Common ISR code, half buffer event.
 * @details This code handles the portable part of the ISR code:
 *          - Callback invocation.
 *          .
 * @note    This macro is meant to be used in the low level drivers
 *          implementation only.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object
 *
 * @notapi
 */
#define _adc_isr_half_code(adcp) {                                          \
  if ((adcp)->grpp->end_cb != NULL) {                                       \
    (adcp)->grpp->end_cb(adcp, (adcp)->samples, (adcp)->depth / 2U);         \
  }                                                                         \
}

/**
 * @brief   Common ISR code, full buffer event.
 * @details This code handles the portable part of the ISR code:
 *          - Callback invocation.
 *          - Waiting thread wakeup, if any.
 *          - Driver state transitions.
 *          .
 * @note    This macro is meant to be used in the low level drivers
 *          implementation only.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object
 *
 * @notapi
 */
#define _adc_isr_full_code(adcp) {                                          \
  if ((adcp)->grpp->circular == TRUE) {                                             \
    /* Callback handling.*/                                                 \
    if ((adcp)->grpp->end_cb != NULL) {                                     \
      if ((adcp)->depth > 1U) {                                              \
        /* Invokes the callback passing the 2nd half of the buffer.*/       \
        size_t half = (adcp)->depth / 2U;                                    \
        size_t half_index = half * (adcp)->grpp->num_channels;              \
        (adcp)->grpp->end_cb(adcp, (adcp)->samples + half_index, half);     \
      }                                                                     \
      else {                                                                \
        /* Invokes the callback passing the whole buffer.*/                 \
        (adcp)->grpp->end_cb(adcp, (adcp)->samples, (adcp)->depth);         \
      }                                                                     \
    }                                                                       \
  }                                                                         \
  else {                                                                    \
    /* End conversion.*/                                                    \
    adc_lld_stop_conversion(adcp);                                          \
    if ((adcp)->grpp->end_cb != NULL) {                                     \
        if ((adcp)->depth > 1U) {                                            \
        /* Invokes the callback passing the 2nd half of the buffer.*/       \
        size_t half = (adcp)->depth / 2U;                                    \
        size_t half_index = half * (adcp)->grpp->num_channels;              \
        (adcp)->grpp->end_cb(adcp, (adcp)->samples + half_index, half);     \
      }                                                                     \
      else {                                                                \
        /* Invokes the callback passing the whole buffer.*/                 \
        (adcp)->grpp->end_cb(adcp, (adcp)->samples, (adcp)->depth);         \
      }                                                                     \
    }                                                                       \
  }                                                                         \
}

/**
 * @brief   Common ISR code, error event.
 * @details This code handles the portable part of the ISR code:
 *          - Callback invocation.
 *          - Waiting thread timeout signaling, if any.
 *          - Driver state transitions.
 *          .
 * @note    This macro is meant to be used in the low level drivers
 *          implementation only.
 *
 * @param[in] adcp      pointer to the @p ADCDriver object
 * @param[in] err       platform dependent error code
 *
 * @notapi
 */
#define _adc_isr_error_code(adcp, err) {                                    \
  adc_lld_stop_conversion(adcp);                                            \
  if ((adcp)->grpp->error_cb != NULL) {                                     \
    (adcp)->grpp->error_cb(adcp, err);                                      \
  }                                                                         \
  (adcp)->grpp = NULL;                                                      \
}
/** @} */

/*===========================================================================*/
/* IRQ Handlers                                                              */
/*===========================================================================*/

#if (SPC5_ADC_USE_ADC0 == TRUE)
IRQ_HANDLER(SPC5_ADC0_WD_HANDLER);
IRQ_HANDLER(SPC5_ADC0_EOC_HANDLER);
#endif

#if (SPC5_ADC_USE_ADC1 == TRUE)
IRQ_HANDLER(SPC5_ADC1_WD_HANDLER);
IRQ_HANDLER(SPC5_ADC1_EOC_HANDLER);
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if (SPC5_ADC_USE_ADC0 == TRUE) && !defined(__DOXYGEN__)
extern ADCDriver ADCD1;
#endif

#if (SPC5_ADC_USE_ADC1 == TRUE) && !defined(__DOXYGEN__)
extern ADCDriver ADCD2;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void adc_lld_init(void);
  void adc_lld_start(ADCDriver *adcp, const ADCConfig *config);
  void adc_lld_stop(ADCDriver *adcp);
  void adc_lld_start_conversion (ADCDriver *adcp, const ADCConversionGroup *grpp, adcsample_t *samples, size_t depth);
  void adc_lld_stop_conversion(ADCDriver *adcp);
  uint32_t adc_get_awd_err(ADCDriver *adcp);
  void adc_clear_awd_err(ADCDriver *adcp);
#ifdef __cplusplus
}
#endif

#endif /* LLD_USE_ADC */

#endif /* _ADC_LLD_H_ */

/** @} */
